posts/4Emacs/ivy-cscope.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducing ivy-cscope.el, using cscope in Emacs with ivy completion!</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Introducing ivy-cscope.el, using cscope in Emacs with ivy completion!</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd51a1c5">1. Introduction</a></li>
<li><a href="#org2aa5396">2. Example usage:</a>
<ul>
<li><a href="#orgc177a7d">2.1. You can bind the key map by:</a></li>
<li><a href="#org8b5a73f">2.2. Also for quick access:</a></li>
<li><a href="#org4503ed9">2.3. Get familiar with ivy actions:</a></li>
<li><a href="#org105ee26">2.4. Other hints when using ivy completion (not directly related to this package)</a></li>
</ul>
</li>
<li><a href="#org70e9ecc">3. Other Emacs cscope packages:</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd51a1c5" class="outline-2">
<h2 id="orgd51a1c5"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<b><a href="https://github.com/Raphus-cucullatus/ivy-cscope.el">ivy-cscope.el</a></b> is yet another interface for <a href="http://cscope.sourceforge.net">cscope</a> in Emacs.
</p>

<p>
Compared with other cscope package in Emacs, It features using <a href="https://github.com/abo-abo/swiper">ivy</a> to display and select the cscope jump candidates.  It also uses "ivy actions" to perform rich actions (e.g. open other window, open other window without focus) on the jump candidates.
</p>

<p>
It provides
</p>
<ul class="org-ul">
<li><code>ivy-cscope-find-xxx</code>: 9 functions each for cscope's menu (e.g. symbol, definition, assignment, calling, &#x2026;).</li>
<li><code>ivy-cscope-find-definition-at-point</code>: a handy command to find the definition of the symbol at point.</li>
<li><code>ivy-cscope-pop-mark</code>: jump back to the location before the last <code>ivy-cscope-xxxx</code> jump.</li>
<li><code>ivy-cscope-command-map</code>: a keymap of all the commands above.</li>
</ul>
</div>
</div>

<div id="outline-container-org2aa5396" class="outline-2">
<h2 id="org2aa5396"><span class="section-number-2">2</span> Example usage:</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc177a7d" class="outline-3">
<h3 id="orgc177a7d"><span class="section-number-3">2.1</span> You can bind the key map by:</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key c-mode-base-map (kbd <span style="font-style: italic;">"C-c j c"</span>) ivy-cscope-command-map)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b5a73f" class="outline-3">
<h3 id="org8b5a73f"><span class="section-number-3">2.2</span> Also for quick access:</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key c-mode-base-map (kbd <span style="font-style: italic;">"M-."</span>) 'ivy-cscope-find-definition-at-point)
(define-key c-mode-base-map (kbd <span style="font-style: italic;">"M-,"</span>) 'ivy-cscope-pop-mark)
(define-key c-mode-base-map [M-mouse-1] 'ivy-cscope-find-definition-at-point)
(define-key c-mode-base-map [M-S-mouse-1] 'ivy-cscope-pop-mark)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4503ed9" class="outline-3">
<h3 id="org4503ed9"><span class="section-number-3">2.3</span> Get familiar with ivy actions:</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Press <code>C-c j c c</code> (or <code>M-x ivy-cscope-find-caller</code>).</li>
<li>Insert <code>put_user_pages</code> to find functions calling <code>put_user_pages</code>.</li>
<li><p>
A completion list shows up, like
</p>

<pre class="example">
(1/3) Result:
drivers/infiniband/core/umem_odp.c ...
fs/io_uring.c ...
mm/gup.c ...
</pre></li>

<li>Move to some line and press <code>M-o</code> to trigger ivy actions.  A list of actions are shown, for example, open the result in other window, open the result in other window without focus, &#x2026;.</li>
</ol>
</div>
</div>

<div id="outline-container-org105ee26" class="outline-3">
<h3 id="org105ee26"><span class="section-number-3">2.4</span> Other hints when using ivy completion (not directly related to this package)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
If you use <a href="https://github.com/abo-abo/avy">avy</a>, you can bind <code>ivy-avy</code> so that you can jump to a specific result with a single key stroke:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key ivy-minibuffer-map (kbd <span style="font-style: italic;">"M-'"</span>) 'ivy-avy)
</pre>
</div>

<p>
When in ivy minibuffer, one can use 
</p>
<ul class="org-ul">
<li><code>C-M-m</code> to preview the current candidate (select the candidate while remain the point in the minibuffer).</li>
<li><code>C-M-n</code> to preview the next candidate.</li>
<li><code>C-M-p</code> to preview the previous candidate.</li>
<li><code>C-g</code> to abort the preview.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org70e9ecc" class="outline-2">
<h2 id="org70e9ecc"><span class="section-number-2">3</span> Other Emacs cscope packages:</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/dkogan/xcscope.el">xcscope.el</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: May 20, 2020</p>
</div>
</body>
</html>
